 
/***************************************************************************
* @file:encoder.h 
* @author:   
* @date:  5,29,2019
* @brief:  编码相关函数头文件
* @attention:
***************************************************************************/
#ifndef _ENCODER_H
#define _ENCODER_H

#ifdef __cplusplus
extern "C"
{
#endif
	 	 
/*******************************************************************************
*@ Description    :编码系统初始化
*@ Input          :
*@ Output         :
*@ Return         :
*@ attention      :内部初始化的顺序不可随意变动，修改时需要注意
*******************************************************************************/
int encoder_system_init(void);

/*******************************************************************************
*@ Description    :编码系统退出
*@ Input          :
*@ Output         :
*@ Return         :
*@ attention      :内部退出的先后顺序不能随意改变，修改时需要注意
*******************************************************************************/
int encoder_system_exit(void);

#ifdef __cplusplus
}
#endif	 
	 
#endif



