
/***************************************************************************
* @file:osd.h 
* @author:   
* @date:  5,31,2019
* @brief: OSD操作相关函数头文件 
* @attention:
***************************************************************************/
#ifndef _OSD_H
#define _OSD_H


/*******************************************************************************
*@ Description    :OSD初始化函数
*@ Input          :
*@ Output         :
*@ Return         :成功：HLE_RET_OK(0) ; 失败：HLE_RET_ERROR(-1)
*@ attention      :
*******************************************************************************/
int osd_init(void);
/*******************************************************************************
*@ Description    :OSD退出
*@ Input          :
*@ Output         :
*@ Return         :成功：HLE_RET_OK(0) ; 失败：HLE_RET_ERROR(-1)
*@ attention      :
*******************************************************************************/
int osd_exit(void);

/*******************************************************************************
*@ Description    :创建OSD时间戳更新线程
*@ Input          :
*@ Output         :
*@ Return         :成功：HLE_RET_OK(0) ; 失败：HLE_RET_ERROR(-1)
*@ attention      :
*******************************************************************************/
int timestamp_update_task(void);


#endif 


